cask_args appdir: "/Applications"

tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/versions"
tap "caskroom/cask"

cask "alfred"
cask "caffeine"
cask "spectacle"
cask "iterm2"
cask "atom"
cask "visual-studio-code"

# Shell
brew "zsh"
brew "zplug"
brew "zsh-completions"

# Tools
brew "watch"
brew "tree"
brew "jq"
brew "curl"
brew "wget"
brew "htop"

# Environment managers
brew "pyenv"
brew "jenv"
brew "rbenv"
brew "nodenv"

# Misc
brew "yadm"
brew "openssl"
